; domain
; The researchers domain where a group of researchers meet at conferences, go to parties together after attending the conference to get to know other researches and eventually publish papers together.
; This is a very simple domain in which the main difficulty lies in grounding the problem due to the very high number of grounded actions

(define (domain researchers)
(:requirements :strips :typing :equality)
(:types researcher institution - object 
        mathematician computer_scientist - researcher
)

(:predicates
    (coauthor ?x - researcher ?y - researcher)
    (knows ?x - researcher ?y - researcher)
    (works_at ?x - researcher ?y - institution)
)

(:action beers-after-conference-m3-c2
                    :parameters (?m1 ?m2 ?m3 - mathematician ?c1 ?c2 - computer_scientist)
                    :precondition (and (not (= ?m1 ?m2)) (not (= ?m1 ?m3)) (not (= ?m2 ?m3)) (not (= ?c1 ?c2)) (knows ?m1 ?c1) (knows ?c1 ?m1) (knows ?m2 ?c2) (knows ?c2 ?m2) (knows ?m3 ?c2) (knows ?c2 ?m3))
                    :effect (and (knows ?c1 ?c2) (knows ?c1 ?m3) (knows ?c1 ?m2) (knows ?m1 ?c2) (knows ?m1 ?m3) (knows ?m1 ?m2) (knows ?c2 ?c1) (knows ?c2 ?m1) (knows ?m3 ?c1) (knows ?m3 ?m1) (knows ?m3 ?m2) (knows ?m2 ?c1) (knows ?m2 ?m1) (knows ?m2 ?m3)))
           
(:action beers-after-conference-m5-c2
                    :parameters (?m1 ?m2 ?m3 ?m4 ?m5 - mathematician ?c1 ?c2 - computer_scientist)
                    :precondition (and (not (= ?m1 ?m2)) (not (= ?m1 ?m3)) (not (= ?m1 ?m4)) (not (= ?m1 ?m5)) (not (= ?m2 ?m3)) (not (= ?m2 ?m4)) (not (= ?m2 ?m5)) (not (= ?m3 ?m4)) (not (= ?m3 ?m5)) (not (= ?m4 ?m5)) (not (= ?c1 ?c2)) (knows ?m1 ?m5) (knows ?c1 ?c2) (knows ?m4 ?c2) (knows ?m3 ?m1) (knows ?m1 ?m3) (knows ?c2 ?m4) (knows ?c2 ?c1) (knows ?m1 ?m2) (knows ?m2 ?m1) (knows ?m3 ?m2) (knows ?m5 ?m1) (knows ?m2 ?m3))
                    :effect (and (knows ?m4 ?c1) (knows ?m4 ?m1) (knows ?m4 ?m3) (knows ?m4 ?m5) (knows ?m4 ?m2) (knows ?c2 ?m1) (knows ?c2 ?m3) (knows ?c2 ?m5) (knows ?c2 ?m2) (knows ?c1 ?m4) (knows ?c1 ?m1) (knows ?c1 ?m3) (knows ?c1 ?m5) (knows ?c1 ?m2) (knows ?m1 ?m4) (knows ?m1 ?c2) (knows ?m1 ?c1) (knows ?m3 ?m4) (knows ?m3 ?c2) (knows ?m3 ?c1) (knows ?m3 ?m5) (knows ?m5 ?m4) (knows ?m5 ?c2) (knows ?m5 ?c1) (knows ?m5 ?m3) (knows ?m5 ?m2) (knows ?m2 ?m4) (knows ?m2 ?c2) (knows ?m2 ?c1) (knows ?m2 ?m5)))
           
(:action beers-after-conference-m2-c3
                    :parameters (?m1 ?m2 - mathematician ?c1 ?c2 ?c3 - computer_scientist)
                    :precondition (and (not (= ?m1 ?m2)) (not (= ?c1 ?c2)) (not (= ?c1 ?c3)) (not (= ?c2 ?c3)) (knows ?c1 ?m2) (knows ?m2 ?c1) (knows ?m1 ?c2) (knows ?c2 ?m1) (knows ?c1 ?c3) (knows ?m2 ?c3) (knows ?c3 ?c1) (knows ?c3 ?m2))
                    :effect (and (knows ?c2 ?c1) (knows ?c2 ?c3) (knows ?c2 ?m2) (knows ?m1 ?c1) (knows ?m1 ?c3) (knows ?m1 ?m2) (knows ?c1 ?c2) (knows ?c1 ?m1) (knows ?c3 ?c2) (knows ?c3 ?m1) (knows ?m2 ?c2) (knows ?m2 ?m1)))
           

       (:action publish-paper-2
       :parameters (?r1 - researcher ?r2 - researcher)
       :precondition (and (knows ?r1 ?r2) (knows ?r2 ?r1))
       :effect (and (coauthor ?r1 ?r2) (coauthor ?r2 ?r1))
       )
       

       (:action publish-paper-3
       :parameters (?r1 - researcher ?r2 - researcher ?r3 - researcher)
       :precondition (and (knows ?r1 ?r2) (knows ?r1 ?r3) (knows ?r2 ?r1) (knows ?r2 ?r3) (knows ?r3 ?r1) (knows ?r3 ?r2))
       :effect (and (coauthor ?r1 ?r2) (coauthor ?r1 ?r3) (coauthor ?r2 ?r1) (coauthor ?r2 ?r3) (coauthor ?r3 ?r1) (coauthor ?r3 ?r2))
       )
       

       (:action publish-paper-4
       :parameters (?r1 - researcher ?r2 - researcher ?r3 - researcher ?r4 - researcher)
       :precondition (and (knows ?r1 ?r2) (knows ?r1 ?r3) (knows ?r1 ?r4) (knows ?r2 ?r1) (knows ?r2 ?r3) (knows ?r2 ?r4) (knows ?r3 ?r1) (knows ?r3 ?r2) (knows ?r3 ?r4) (knows ?r4 ?r1) (knows ?r4 ?r2) (knows ?r4 ?r3))
       :effect (and (coauthor ?r1 ?r2) (coauthor ?r1 ?r3) (coauthor ?r1 ?r4) (coauthor ?r2 ?r1) (coauthor ?r2 ?r3) (coauthor ?r2 ?r4) (coauthor ?r3 ?r1) (coauthor ?r3 ?r2) (coauthor ?r3 ?r4) (coauthor ?r4 ?r1) (coauthor ?r4 ?r2) (coauthor ?r4 ?r3))
       )
       

       (:action publish-paper-5
       :parameters (?r1 - researcher ?r2 - researcher ?r3 - researcher ?r4 - researcher ?r5 - researcher)
       :precondition (and (knows ?r1 ?r2) (knows ?r1 ?r3) (knows ?r1 ?r4) (knows ?r1 ?r5) (knows ?r2 ?r1) (knows ?r2 ?r3) (knows ?r2 ?r4) (knows ?r2 ?r5) (knows ?r3 ?r1) (knows ?r3 ?r2) (knows ?r3 ?r4) (knows ?r3 ?r5) (knows ?r4 ?r1) (knows ?r4 ?r2) (knows ?r4 ?r3) (knows ?r4 ?r5) (knows ?r5 ?r1) (knows ?r5 ?r2) (knows ?r5 ?r3) (knows ?r5 ?r4))
       :effect (and (coauthor ?r1 ?r2) (coauthor ?r1 ?r3) (coauthor ?r1 ?r4) (coauthor ?r1 ?r5) (coauthor ?r2 ?r1) (coauthor ?r2 ?r3) (coauthor ?r2 ?r4) (coauthor ?r2 ?r5) (coauthor ?r3 ?r1) (coauthor ?r3 ?r2) (coauthor ?r3 ?r4) (coauthor ?r3 ?r5) (coauthor ?r4 ?r1) (coauthor ?r4 ?r2) (coauthor ?r4 ?r3) (coauthor ?r4 ?r5) (coauthor ?r5 ?r1) (coauthor ?r5 ?r2) (coauthor ?r5 ?r3) (coauthor ?r5 ?r4))
       )
       

       (:action meet-at-institution-2
       :parameters (?r1 - researcher ?r2 - researcher ?i - institution)
       :precondition (and  (not (= ?r1 ?r2)) (works_at ?r1 ?i) (works_at ?r2 ?i))
       :effect (and (knows ?r1 ?r2) (knows ?r2 ?r1))
       )
       

(:action read-math-paper
  :parameters (?r1 ?r2 - mathematician)
  :effect (knows ?r1 ?r2)
)

(:action read-cs-paper
  :parameters (?r1 ?r2 - computer_scientist)
  :effect (knows ?r1 ?r2)
)


)

; problem
(define (problem researchers-7-1) 
(:domain researchers)
(:objects researcher1 - computer_scientist
researcher2 - mathematician
researcher3 - mathematician
researcher4 - computer_scientist
researcher5 - mathematician
researcher6 - computer_scientist
researcher7 - mathematician
institution1 - institution)

(:init
   (works_at researcher1 institution1)
(works_at researcher2 institution1)
(works_at researcher3 institution1)
(works_at researcher4 institution1)
(works_at researcher5 institution1)
(works_at researcher6 institution1)
(works_at researcher7 institution1)
)

(:goal 
(and
   (coauthor researcher5 researcher7)
(coauthor researcher4 researcher6)
(coauthor researcher1 researcher5)
(coauthor researcher1 researcher4)
(coauthor researcher3 researcher5)
(coauthor researcher2 researcher5)
(coauthor researcher3 researcher7)
(coauthor researcher4 researcher5)
(coauthor researcher6 researcher7)
(coauthor researcher2 researcher6)
)
)
)

; plan
1. (meet-at-institution-2 researcher1 researcher4 institution1)
   added: (knows researcher1 researcher4) (knows researcher4 researcher1)
   goals met: 0 of 10
2. (meet-at-institution-2 researcher1 researcher5 institution1)
   added: (knows researcher1 researcher5) (knows researcher5 researcher1)
   goals met: 0 of 10
3. (meet-at-institution-2 researcher2 researcher5 institution1)
   added: (knows researcher2 researcher5) (knows researcher5 researcher2)
   goals met: 0 of 10
4. (meet-at-institution-2 researcher2 researcher6 institution1)
   added: (knows researcher2 researcher6) (knows researcher6 researcher2)
   goals met: 0 of 10
5. (meet-at-institution-2 researcher3 researcher5 institution1)
   added: (knows researcher3 researcher5) (knows researcher5 researcher3)
   goals met: 0 of 10
6. (meet-at-institution-2 researcher3 researcher7 institution1)
   added: (knows researcher3 researcher7) (knows researcher7 researcher3)
   goals met: 0 of 10
7. (meet-at-institution-2 researcher4 researcher5 institution1)
   added: (knows researcher4 researcher5) (knows researcher5 researcher4)
   goals met: 0 of 10
8. (meet-at-institution-2 researcher4 researcher6 institution1)
   added: (knows researcher4 researcher6) (knows researcher6 researcher4)
   goals met: 0 of 10
9. (meet-at-institution-2 researcher5 researcher7 institution1)
   added: (knows researcher5 researcher7) (knows researcher7 researcher5)
   goals met: 0 of 10
10. (meet-at-institution-2 researcher6 researcher7 institution1)
   added: (knows researcher6 researcher7) (knows researcher7 researcher6)
   goals met: 0 of 10
11. (publish-paper-2 researcher2 researcher6)
   added: (coauthor researcher2 researcher6) (coauthor researcher6 researcher2)
   goals met: 1 of 10
12. (publish-paper-3 researcher1 researcher4 researcher5)
   added: (coauthor researcher1 researcher4) (coauthor researcher1 researcher5) (coauthor researcher4 researcher1) (coauthor researcher4 researcher5) (coauthor researcher5 researcher1) (coauthor researcher5 researcher4)
   goals met: 4 of 10
13. (publish-paper-2 researcher6 researcher7)
   added: (coauthor researcher6 researcher7) (coauthor researcher7 researcher6)
   goals met: 5 of 10
14. (publish-paper-2 researcher4 researcher6)
   added: (coauthor researcher4 researcher6) (coauthor researcher6 researcher4)
   goals met: 6 of 10
15. (publish-paper-3 researcher3 researcher5 researcher7)
   added: (coauthor researcher3 researcher5) (coauthor researcher3 researcher7) (coauthor researcher5 researcher3) (coauthor researcher5 researcher7) (coauthor researcher7 researcher3) (coauthor researcher7 researcher5)
   goals met: 9 of 10
16. (publish-paper-2 researcher2 researcher5)
   added: (coauthor researcher2 researcher5) (coauthor researcher5 researcher2)
   goals met: 10 of 10
